Revit 2027 API
RoomFilter Constructor
 Constructs a filter which matches only rooms.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RoomFilter()
Public Sub New
public:
RoomFilter()
new : unit -> RoomFilter
See Also
Reference
RoomFilter Class
Autodesk.Revit.DB.Architecture Namespace